Revit 2024 API
OBJImportOptions Constructor (OBJImportOptions)
 Constructs a new instance of OBJImportOptions as a copy of the import options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022.1
Syntax
C#
public OBJImportOptions(
	OBJImportOptions option
)
Visual Basic
Public Sub New ( _
	option As OBJImportOptions _
)
Visual C++
public:
OBJImportOptions(
	OBJImportOptions^ option
)
Parameters
option
Type: Autodesk.Revit.DB.OBJImportOptions
 The OBJ options to be copied.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
OBJImportOptions Class
OBJImportOptions Overload
Autodesk.Revit.DB Namespace